[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.jsx:20:31
     },
   });
 
-  const onSuccess = (item) => {
-    toast(`New menu item Created - id: ${item.id} name: ${item.name}`);
-  };
+  const onSuccess = (item) => {};
 
   const mutation = useBackendMutation(
killedBy: UCSBDiningCommonsMenuItemCreatePage tests on submit, makes request to backend, and redirects to /diningcommonsmenuitem
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] StringLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.jsx:21:11
   });
 
   const onSuccess = (item) => {
-    toast(`New menu item Created - id: ${item.id} name: ${item.name}`);
+    toast(``);
   };
 
killedBy: UCSBDiningCommonsMenuItemCreatePage tests on submit, makes request to backend, and redirects to /diningcommonsmenuitem
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "New menu item Created - id: 17 name: Baked Pesto Pasta with Chicken",
