[Killed] ArrowFunction
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:30:34
     },
   );
 
-  const objectToAxiosPutParams = (item) => ({
-    url: "/api/ucsbdiningcommonsmenuitem",
-    method: "PUT",
-    params: {
-      id: item.id,
-    },
-    data: {
-      diningCommonsCode: item.diningCommonsCode,
-      name: item.name,
-      station: item.station,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (item) => {
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "Menu item Updated - id: 17 name: Cream of Broccoli Soup",

[Killed] ObjectLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:30:45
     },
   );
 
-  const objectToAxiosPutParams = (item) => ({
-    url: "/api/ucsbdiningcommonsmenuitem",
-    method: "PUT",
-    params: {
-      id: item.id,
-    },
-    data: {
-      diningCommonsCode: item.diningCommonsCode,
-      name: item.name,
-      station: item.station,
-    },
-  });
+  const objectToAxiosPutParams = (item) => ({});
 
   const onSuccess = (item) => {
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "Menu item Updated - id: 17 name: Cream of Broccoli Soup",

[Killed] StringLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:31:10
   );
 
   const objectToAxiosPutParams = (item) => ({
-    url: "/api/ucsbdiningcommonsmenuitem",
+    url: "",
     method: "PUT",
     params: {
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "Menu item Updated - id: 17 name: Cream of Broccoli Soup",

[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:43:31
     },
   });
 
-  const onSuccess = (item) => {
-    toast(`Menu item Updated - id: ${item.id} name: ${item.name}`);
-  };
+  const onSuccess = (item) => {};
 
   const mutation = useBackendMutation(
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] StringLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:44:11
   });
 
   const onSuccess = (item) => {
-    toast(`Menu item Updated - id: ${item.id} name: ${item.name}`);
+    toast(``);
   };
 
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "Menu item Updated - id: 17 name: Cream of Broccoli Soup",

[Killed] LogicalOperator
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:68:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit UCSBDiningCommonsMenuItem</h1>
-        {menuItem && (
-          <UCSBDiningCommonsMenuItemForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={menuItem}
-          />
-        )}
+        {menuItem || <UCSBDiningCommonsMenuItemForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={menuItem} />}
       </div>
     </BasicLayout>
killedBy: UCSBDiningCommonsMenuItemEditPage tests when the backend doesn't return data renders header but form is not present
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input
  class="form-control"
  data-testid="UCSBDiningCommonsMenuItemForm-name"
  id="name"
  name="name"
  type="text"

[Killed] ConditionalExpression
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:68:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit UCSBDiningCommonsMenuItem</h1>
-        {menuItem && (
-          <UCSBDiningCommonsMenuItemForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={menuItem}
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
