[Killed] ObjectLiteral
main/components/RecommendationRequests/RecommendationRequestForm.jsx:71:24
           isInvalid={Boolean(errors.professorEmail)}
           {...register("professorEmail", {
             required: "Professor Email is required.",
-            maxLength: {
-              value: 255,
-              message: "Max length 255 characters",
-            },
+            maxLength: {},
           })}
         />
killedBy: recommendationRequestForm tests max length restrictions work on professor email
statusReason: Unable to find an element with the text: /Max length 255 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
