[Killed] ArrowFunction
main/pages/RecommendationRequests/RecommendationRequestsEditPage.jsx:28:34
     },
   );
 
-  const objectToAxiosPutParams = (recommendationRequest) => ({
-    url: "/api/recommendationRequest",
-    method: "PUT",
-    params: {
-      id: recommendationRequest.id,
-    },
-    data: {
-      requesterEmail: recommendationRequest.requesterEmail,
-      professorEmail: recommendationRequest.professorEmail,
-      explanation: recommendationRequest.explanation,
-      dateRequested: recommendationRequest.dateRequested,
-      dateNeeded: recommendationRequest.dateNeeded,
-      done: recommendationRequest.done,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (recommendationRequest) => {
killedBy: RecommendationRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "RecommendationRequest Updated - id: 17 requesterEmail: soome1@ucsb.edu",

[Killed] StringLiteral
main/pages/RecommendationRequests/RecommendationRequestsEditPage.jsx:29:10
   );
 
   const objectToAxiosPutParams = (recommendationRequest) => ({
-    url: "/api/recommendationRequest",
+    url: "",
     method: "PUT",
     params: {
killedBy: RecommendationRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "RecommendationRequest Updated - id: 17 requesterEmail: soome1@ucsb.edu",
