[Killed] ObjectLiteral
main/components/MenuItemReviews/MenuItemReviewForm.jsx:93:18
           isInvalid={Boolean(errors.stars)}
           {...register("stars", {
             required: "Stars is required.",
-            min: {
-              value: 1,
-              message: "Stars must be between 1 and 5",
-            },
+            min: {},
             max: {
               value: 5,
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Stars must be between 1 and 5/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewForm.jsx:95:24
             required: "Stars is required.",
             min: {
               value: 1,
-              message: "Stars must be between 1 and 5",
+              message: "",
             },
             max: {
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Stars must be between 1 and 5/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/MenuItemReviews/MenuItemReviewForm.jsx:97:18
               value: 1,
               message: "Stars must be between 1 and 5",
             },
-            max: {
-              value: 5,
-              message: "Stars must be between 1 and 5",
-            },
+            max: {},
           })}
         />
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Stars must be between 1 and 5/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewForm.jsx:99:24
             },
             max: {
               value: 5,
-              message: "Stars must be between 1 and 5",
+              message: "",
             },
           })}
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Stars must be between 1 and 5/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
