[Killed] ObjectLiteral
main/components/MenuItemReviews/MenuItemReviewTable.jsx:55:5
       header: "Stars",
       accessorKey: "stars",
     },
-    {
-      header: "Date Reviewed (in UTC)",
-      accessorKey: "dateReviewed",
-    },
+    {},
     {
       header: "Comments",
killedBy: MenuItemReviewTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewTable.jsx:56:15
       accessorKey: "stars",
     },
     {
-      header: "Date Reviewed (in UTC)",
+      header: "",
       accessorKey: "dateReviewed",
     },
killedBy: MenuItemReviewTable tests renders empty table correctly
statusReason: Unable to find an element with the text: Date Reviewed (in UTC). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="MenuItemReviewTable"
