[Killed] ObjectLiteral
main/pages/MenuItemReviews/MenuItemReviewCreatePage.jsx:8:52
 import { toast } from "react-toastify";
 
 export default function MenuItemReviewCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (menuItemReview) => ({
-    url: "/api/menuitemreview/post",
-    method: "POST",
-    params: {
-      itemId: menuItemReview.itemId,
-      reviewerEmail: menuItemReview.reviewerEmail,
-      stars: menuItemReview.stars,
-      dateReviewed: menuItemReview.dateReviewed,
-      comments: menuItemReview.comments,
-    },
-  });
+  const objectToAxiosParams = (menuItemReview) => ({});
 
   const onSuccess = (menuItemReview) => {
killedBy: MenuItemReviewCreatePage tests on submit, makes request to backend, and redirects to /menuitemreview
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
main/pages/MenuItemReviews/MenuItemReviewCreatePage.jsx:39:32
     mutation.mutate(data);
   };
 
-  if (isSuccess && !storybook) {
-    return <Navigate to="/menuItemReviews" />;
-  }
+  if (isSuccess && !storybook) {}
 
   return (
killedBy: MenuItemReviewCreatePage tests on submit, makes request to backend, and redirects to /menuitemreview
statusReason: expected "vi.fn()" to be called with arguments: [ { to: '/menuItemReviews' } ]

Number of calls: 0
