[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:49:23
           type="text"
           isInvalid={Boolean(errors.orgTranslationShort)}
           {...register("orgTranslationShort", {
-            required: "Short Translation is required.",
+            required: "",
           })}
         />
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: Short Translation is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:64:42
           id="orgTranslation"
           type="text"
           isInvalid={Boolean(errors.orgTranslation)}
-          {...register("orgTranslation", {
-            required: "Translation is required.",
-          })}
+          {...register("orgTranslation", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: Translation is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
