[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:46:15
       accessorKey: "orgTranslationShort",
     },
     {
-      header: "Translation",
+      header: "",
       accessorKey: "orgTranslation",
     },
killedBy: UCSBOrganizationTable tests renders empty table correctly
statusReason: Unable to find an element with the text: Translation. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBOrganizationTable"
