[Killed] StringLiteral
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.jsx:21:7
 
   const onSuccess = (ucsbOrganization) => {
     toast(
-      `New UCSBOrganization Created - orgCode: ${ucsbOrganization.orgCode}`,
+      ``,
     );
   };
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /ucsborganization
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "New UCSBOrganization Created - orgCode: SKY",
