[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:18:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     [`/api/ucsborganization?orgCode=${id}`],
-    {
-      // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
-      method: "GET",
-      url: `/api/ucsborganization`,
-      params: {
-        orgCode: id,
-      },
-    },
+    {},
   );
 
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
