[Killed] ObjectLiteral
main/components/Articles/ArticlesTable.jsx:42:5
       header: "Title",
       accessorKey: "title",
     },
-    {
-      header: "URL",
-      accessorKey: "url",
-    },
+    {},
     {
       header: "Explanation",
killedBy: ArticlesTable tests Has the expected column headers and content for ordinary user
statusReason: Columns require an id when using a non-string header

[Killed] ObjectLiteral
main/components/Articles/ArticlesTable.jsx:54:5
       header: "Email",
       accessorKey: "email",
     },
-    {
-      header: "Date",
-      accessorKey: "localDateTime",
-    },
+    {},
   ];
 
killedBy: ArticlesTable tests Has the expected column headers and content for ordinary user
statusReason: Columns require an id when using a non-string header
