[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestForm.jsx:68:22
           isInvalid={Boolean(errors.requesterEmail)}
           {...register("requesterEmail", {
             required: "Requester Email is required.",
-            pattern: {
-              value: email_regex,
-              message: "Requester Email must be a valid email address.",
-            },
+            pattern: {},
           })}
         />
killedBy: HelpRequestForm tests bad-input validation messages
statusReason: Unable to find an element with the text: /Requester Email must be a valid email address\./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestForm.jsx:88:24
           isInvalid={Boolean(errors.teamId)}
           {...register("teamId", {
             required: "Team Id is required.",
-            maxLength: {
-              value: 30,
-              message: "Max length 30 characters",
-            },
+            maxLength: {},
           })}
         />
killedBy: HelpRequestForm tests bad-input validation messages
statusReason: Unable to find an element with the text: /Max length 30 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
