[Killed] StringLiteral
main/pages/Articles/ArticlesEditPage.jsx:15:19
     data: article,
     _error,
     _status,
-  } = useBackend([`/api/articles?id=${id}`], {
+  } = useBackend([``], {
     // Stryker disable next-line all : GET is the default method
     method: "GET",
killedBy: ArticlesEditPage tests tests where backend is working normally renders without crashing
statusReason: expected undefined to deeply equal { id: 17, title: 'article 1', …(4) }
