[Killed] ArrowFunction
main/pages/HelpRequest/HelpRequestCreatePage.jsx:10:31
 export default function HelpRequestCreatePage({ storybook = false }) {
   const navigate = useNavigate();
 
-  const objectToAxiosParams = (helpRequest) => ({
-    url: "/api/helprequests/post",
-    method: "POST",
-    params: {
-      requesterEmail: helpRequest.requesterEmail,
-      teamId: helpRequest.teamId,
-      tableOrBreakoutRoom: helpRequest.tableOrBreakoutRoom,
-      requestTime: helpRequest.requestTime,
-      explanation: helpRequest.explanation,
-      solved: helpRequest.solved,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (helpRequest) => {
killedBy: HelpRequestCreatePage tests on submit with valid data, POST then toast and redirect to /helprequest
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
main/pages/HelpRequest/HelpRequestCreatePage.jsx:11:10
   const navigate = useNavigate();
 
   const objectToAxiosParams = (helpRequest) => ({
-    url: "/api/helprequests/post",
+    url: "",
     method: "POST",
     params: {
killedBy: HelpRequestCreatePage tests on submit with valid data, POST then toast and redirect to /helprequest
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "New Help Request Created - id: 5 email: cgaucho@ucsb.edu",

[Killed] BlockStatement
main/pages/HelpRequest/HelpRequestCreatePage.jsx:23:38
     },
   });
 
-  const onSuccess = (helpRequest) => {
-    toast(
-      `New Help Request Created - id: ${helpRequest.id} email: ${helpRequest.requesterEmail}`,
-    );
-    if (!storybook) {
-      navigate("/helprequest", { replace: true });
-    }
-  };
+  const onSuccess = (helpRequest) => {};
 
   const mutation = useBackendMutation(
killedBy: HelpRequestCreatePage tests on submit with valid data, POST then toast and redirect to /helprequest
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/pages/HelpRequest/HelpRequestCreatePage.jsx:27:21
     toast(
       `New Help Request Created - id: ${helpRequest.id} email: ${helpRequest.requesterEmail}`,
     );
-    if (!storybook) {
-      navigate("/helprequest", { replace: true });
-    }
+    if (!storybook) {}
   };
 
killedBy: HelpRequestCreatePage tests on submit with valid data, POST then toast and redirect to /helprequest
statusReason: expected "vi.fn()" to be called with arguments: [ '/helprequest', { replace: true } ]

Number of calls: 0

[Killed] ConditionalExpression
main/pages/HelpRequest/HelpRequestCreatePage.jsx:27:9
     toast(
       `New Help Request Created - id: ${helpRequest.id} email: ${helpRequest.requesterEmail}`,
     );
-    if (!storybook) {
+    if (false) {
       navigate("/helprequest", { replace: true });
     }
killedBy: HelpRequestCreatePage tests on submit with valid data, POST then toast and redirect to /helprequest
statusReason: expected "vi.fn()" to be called with arguments: [ '/helprequest', { replace: true } ]

Number of calls: 0

[Killed] BooleanLiteral
main/pages/HelpRequest/HelpRequestCreatePage.jsx:28:43
       `New Help Request Created - id: ${helpRequest.id} email: ${helpRequest.requesterEmail}`,
     );
     if (!storybook) {
-      navigate("/helprequest", { replace: true });
+      navigate("/helprequest", { replace: false });
     }
   };
killedBy: HelpRequestCreatePage tests on submit with valid data, POST then toast and redirect to /helprequest
statusReason: expected "vi.fn()" to be called with arguments: [ '/helprequest', { replace: true } ]

Received: 

  1st vi.fn() call:

  [
    "/helprequest",

[Killed] StringLiteral
main/pages/HelpRequest/HelpRequestCreatePage.jsx:28:16
       `New Help Request Created - id: ${helpRequest.id} email: ${helpRequest.requesterEmail}`,
     );
     if (!storybook) {
-      navigate("/helprequest", { replace: true });
+      navigate("", { replace: true });
     }
   };
killedBy: HelpRequestCreatePage tests on submit with valid data, POST then toast and redirect to /helprequest
statusReason: expected "vi.fn()" to be called with arguments: [ '/helprequest', { replace: true } ]

Received: 

  1st vi.fn() call:

  [
-   "/helprequest",
