[Killed] ObjectLiteral
main/pages/HelpRequest/HelpRequestEditPage.jsx:18:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     [`/api/helprequests?id=${id}`],
-    {
-      // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
-      method: "GET",
-      url: "/api/helprequests",
-      params: {
-        id,
-      },
-    },
+    {},
   );
 
killedBy: HelpRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="HelpRequestForm-requesterEmail"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/pages/HelpRequest/HelpRequestEditPage.jsx:22:15
       // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
       method: "GET",
       url: "/api/helprequests",
-      params: {
-        id,
-      },
+      params: {},
     },
   );
killedBy: HelpRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="HelpRequestForm-requesterEmail"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/HelpRequest/HelpRequestEditPage.jsx:28:34
     },
   );
 
-  const objectToAxiosPutParams = (hr) => ({
-    url: "/api/helprequests",
-    method: "PUT",
-    params: {
-      id: hr.id,
-    },
-    data: {
-      requesterEmail: hr.requesterEmail,
-      teamId: hr.teamId,
-      tableOrBreakoutRoom: hr.tableOrBreakoutRoom,
-      requestTime: hr.requestTime,
-      explanation: hr.explanation,
-      solved: Boolean(hr.solved),
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (hr) => {
killedBy: HelpRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "Help Request Updated - id: 17 email: cgaucho@ucsb.edu",

[Killed] ObjectLiteral
main/pages/HelpRequest/HelpRequestEditPage.jsx:28:43
     },
   );
 
-  const objectToAxiosPutParams = (hr) => ({
-    url: "/api/helprequests",
-    method: "PUT",
-    params: {
-      id: hr.id,
-    },
-    data: {
-      requesterEmail: hr.requesterEmail,
-      teamId: hr.teamId,
-      tableOrBreakoutRoom: hr.tableOrBreakoutRoom,
-      requestTime: hr.requestTime,
-      explanation: hr.explanation,
-      solved: Boolean(hr.solved),
-    },
-  });
+  const objectToAxiosPutParams = (hr) => ({});
 
   const onSuccess = (hr) => {
killedBy: HelpRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "Help Request Updated - id: 17 email: cgaucho@ucsb.edu",

[Killed] BlockStatement
main/pages/HelpRequest/HelpRequestEditPage.jsx:44:29
     },
   });
 
-  const onSuccess = (hr) => {
-    toast(`Help Request Updated - id: ${hr.id} email: ${hr.requesterEmail}`);
-    if (!storybook) {
-      navigate("/helprequest", { replace: true });
-    }
-  };
+  const onSuccess = (hr) => {};
 
   const mutation = useBackendMutation(
killedBy: HelpRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ConditionalExpression
main/pages/HelpRequest/HelpRequestEditPage.jsx:46:9
 
   const onSuccess = (hr) => {
     toast(`Help Request Updated - id: ${hr.id} email: ${hr.requesterEmail}`);
-    if (!storybook) {
+    if (true) {
       navigate("/helprequest", { replace: true });
     }
killedBy: HelpRequestEditPage tests tests where backend is working normally when storybook=true, successful update does not navigate
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      "/helprequest",

[Killed] BooleanLiteral
main/pages/HelpRequest/HelpRequestEditPage.jsx:46:9
 
   const onSuccess = (hr) => {
     toast(`Help Request Updated - id: ${hr.id} email: ${hr.requesterEmail}`);
-    if (!storybook) {
+    if (storybook) {
       navigate("/helprequest", { replace: true });
     }
killedBy: HelpRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called with arguments: [ '/helprequest', { replace: true } ]

Number of calls: 0
