[Killed] BlockStatement
main/pages/HelpRequest/HelpRequestEditPage.jsx:43:29
     },
   });
 
-  const onSuccess = (hr) => {
-    toast(`Help Request Updated - id: ${hr.id} email: ${hr.requesterEmail}`);
-  };
+  const onSuccess = (hr) => {};
 
   const mutation = useBackendMutation(
killedBy: HelpRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>
